## Data Wrangling: Join, Combine, and Reshape

Hierarchical indexing is an important feature of pandas that enables you to have multiple (two or more) index levels on an axis. Somewhat abstractly, it provides a way for you to work with higher dimensional data in a lower dimensional form.

In [3]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
data['b':'c']

b  1    0.285936
   3   -0.039960
c  1   -0.623355
   2    0.313634
dtype: float64

In [6]:
data.loc[['b', 'd']]

b  1    0.285936
   3   -0.039960
d  2    1.031996
   3   -0.677418
dtype: float64

In [7]:
print(data)
data.unstack()

a  1    0.283428
   2   -1.241984
   3    0.584377
b  1    0.285936
   3   -0.039960
c  1   -0.623355
   2    0.313634
d  2    1.031996
   3   -0.677418
dtype: float64

          1         2         3
a  0.283428 -1.241984  0.584377
b  0.285936       NaN -0.039960
c -0.623355  0.313634       NaN
d       NaN  1.031996 -0.677418

In [9]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                   columns=['one', 'two'])

df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                            columns=['three', 'four'])

In [11]:
print(df1)
print(df2)

   one  two
a    0    1
b    2    3
c    4    5
   three  four
a      5     6
c      7     8

In [14]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [20]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

df_f = pd.concat([df1, df1], axis = 0, ignore_index=True)

In [21]:
df_f

          a         b         c         d
0  0.655179  1.842265  0.737498 -1.193590
1  1.928923 -1.433267 -1.089906  0.313238
2  1.496080 -0.616774 -0.042570 -0.057859
3  0.655179  1.842265  0.737498 -1.193590
4  1.928923 -1.433267 -1.089906  0.313238
5  1.496080 -0.616774 -0.042570 -0.057859

In [22]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))

In [23]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [24]:
result = data.stack()

result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [25]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [26]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

In [28]:
pd.melt(df, ['key'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9